In [1]:
import pandas as pd

data={"Name":["alia","aslam"],
      "Age":[23,24],
      "Gender":["Female","Male"]}

df=pd.DataFrame(data)
print(df)

    Name  Age  Gender
0   alia   23  Female
1  aslam   24    Male

In [12]:
Data1=pd.read_excel("C:/Users/BAHRIA/OneDrive/talha mazhar/OneDrive/Desktop/DAILY ROUTINE.xlsx")

df=pd.DataFrame(Data1)

print(df.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 31 entries, 0 to 30
Data columns (total 32 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Unnamed: 0   0 non-null      float64
 1   Unnamed: 1   23 non-null     object
 2   Unnamed: 2   29 non-null     object
 3   Unnamed: 3   22 non-null     object
 4   Unnamed: 4   23 non-null     object
 5   Unnamed: 5   23 non-null     object
 6   Unnamed: 6   23 non-null     object
 7   Unnamed: 7   23 non-null     object
 8   Unnamed: 8   23 non-null     object
 9   Unnamed: 9   23 non-null     object
 10  Unnamed: 10  23 non-null     object
 11  Unnamed: 11  23 non-null     object
 12  Unnamed: 12  23 non-null     object
 13  Unnamed: 13  23 non-null     object
 14  Unnamed: 14  23 non-null     object
 15  Unnamed: 15  24 non-null     object
 16  Unnamed: 16  23 non-null     object
 17  Unnamed: 17  23 non-null     object
 18  Unnamed: 18  23 non-null     object
 19  Unnamed: 19  23 non-null     object
 20  Unnamed: 20  23 non-null     object
 21  Unnamed: 21  26 non-null     object
 22  Unnamed: 22  26 non-null     object
 23  Unnamed: 23  26 non-null     object
 24  Unnamed: 24  26 non-null     object
 25  Unnamed: 25  23 non-null     object
 26  Unnamed: 26  23 non-null     object
 27  Unnamed: 27  23 non-null     object
 28  Unnamed: 28  23 non-null     object
 29  Unnamed: 29  28 non-null     object
 30  Unnamed: 30  23 non-null     object
 31  Unnamed: 31  23 non-null     object
dtypes: float64(1), object(31)
memory usage: 7.9+ KB
None

C:\Users\BAHRIA\AppData\Local\Programs\Python\Python312\Lib\site-packages\openpyxl\worksheet\_reader.py:329: UserWarning: Conditional Formatting extension is not supported and will be removed
  warn(msg)

In [14]:
Data1.describe()

       Unnamed: 0
count         0.0
mean          NaN
std           NaN
min           NaN
25%           NaN
50%           NaN
75%           NaN
max           NaN

In [9]:
import pandas as pd
data=pd.read_excel("expense3.xlsx")
df=pd.DataFrame(data)
print(df.head(10))

        Date    Category       Sub-Category   Amount Payment Mode
0 2023-01-01     Grocery             Grocery      30         Cash
1 2023-01-02        Food          Restaurant     890          UPI
2 2023-01-04       Bills              Zomato     257          NaN
3 2023-01-06  Essentials               Diary     120          UPI
4 2023-01-06  Essentials             Perfume    1500         Cash
5 2023-01-09     Grocery  Fruits and Veggies     456         Cash
6 2023-01-10       Bills          House Rent   16000          UPI
7 2023-01-10     Grocery      Tomato KetchUp      70          UPI
8 2023-01-12        Food                Chai      15          UPI
9 2023-01-15  Essentials      Salt and Sugar      50          UPI

In [10]:
import pandas as pd
data=pd.read_excel("expense3.xlsx")
df=pd.DataFrame(data)
print(df.tail(10))

         Date    Category       Sub-Category   Amount Payment Mode
19 2023-01-23     Grocery      Bread and Milk      56         Cash
20 2023-01-24        Food  Fruits and Veggies     530         Cash
21 2023-01-26        Food                Chai      10          UPI
22 2023-01-26     Grocery               Maggi     140          UPI
23 2023-01-27        Food              Zomato     300          UPI
24 2023-01-27        Food                Chai      10          UPI
25 2023-01-28  Essentials           Bedsheets    1025         Cash
26 2023-01-29       Bills             Mobile     1650          UPI
27 2023-01-29     Grocery                Daal     150         Cash
28 2023-01-30       Bills            Cylinder    1074          UPI

In [11]:
print(df.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 29 entries, 0 to 28
Data columns (total 5 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Date           29 non-null     datetime64[ns]
 1   Category       29 non-null     object
 2   Sub-Category   29 non-null     object
 3   Amount         29 non-null     int64
 4   Payment Mode   26 non-null     object
dtypes: datetime64[ns](1), int64(1), object(3)
memory usage: 1.3+ KB
None

In [13]:
data.describe()

                                Date        Amount
count                             29     29.000000
mean   2023-01-17 19:02:04.137931008   1039.620690
min              2023-01-01 00:00:00     10.000000
25%              2023-01-10 00:00:00     70.000000
50%              2023-01-19 00:00:00    257.000000
75%              2023-01-26 00:00:00    890.000000
max              2023-01-30 00:00:00  16000.000000
std                              NaN   2927.684353

In [15]:
import pandas as pd
data=pd.read_excel("ESD.xlsx")
df=pd.DataFrame(data)

print(df)

       EEID        Full Name                 Job Title  Department  \
0    E02387      Emily Davis                Sr. Manger          IT
1    E04105    Theodore Dinh       Technical Architect          IT
2    E02572     Luna Sanders                  Director     Finance
3    E02832  Penelope Jordan  Computer Systems Manager          IT
4    E01639        Austin Vo               Sr. Analyst     Finance
..      ...              ...                       ...         ...
995  E03094     Wesley Young               Sr. Analyst   Marketing
996  E01909     Lillian Khan                   Analyst     Finance
997  E04398      Oliver Yang                  Director   Marketing
998  E02521      Lily Nguyen               Sr. Analyst     Finance
999  E03545      Sofia Cheng            Vice President  Accounting

              Business Unit  Gender  Ethnicity  Age  Hire Date  Annual Salary  \
0    Research & Development  Female      Black   55 2016-04-08         141604
1             Manufacturing    Male      Asian   59 1997-11-29          99975
2       Speciality Products  Female  Caucasian   50 2006-10-26         163099
3             Manufacturing  Female  Caucasian   26 2019-09-27          84913
4             Manufacturing    Male      Asian   55 1995-11-20          95409
..                      ...     ...        ...  ...        ...            ...
995     Speciality Products    Male  Caucasian   33 2016-09-18          98427
996     Speciality Products  Female      Asian   44 2010-05-31          47387
997     Speciality Products    Male      Asian   31 2019-06-10         176710
998     Speciality Products  Female      Asian   33 2012-01-28          95960
999               Corporate  Female      Asian   63 2020-07-26         216195

     Bonus %        Country       City  Exit Date
0       0.15  United States    Seattle 2021-10-16
1       0.00          China  Chongqing        NaT
2       0.20  United States    Chicago        NaT
3       0.07  United States    Chicago        NaT
4       0.00  United States    Phoenix        NaT
..       ...            ...        ...        ...
995     0.00  United States   Columbus        NaT
996     0.00          China    Chengdu 2018-01-08
997     0.15  United States      Miami        NaT
998     0.00          China    Chengdu        NaT
999     0.31  United States      Miami        NaT

[1000 rows x 14 columns]

In [16]:
print(data.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 14 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   EEID           1000 non-null   object
 1   Full Name      1000 non-null   object
 2   Job Title      1000 non-null   object
 3   Department     1000 non-null   object
 4   Business Unit  1000 non-null   object
 5   Gender         1000 non-null   object
 6   Ethnicity      1000 non-null   object
 7   Age            1000 non-null   int64
 8   Hire Date      1000 non-null   datetime64[ns]
 9   Annual Salary  1000 non-null   int64
 10  Bonus %        1000 non-null   float64
 11  Country        1000 non-null   object
 12  City           1000 non-null   object
 13  Exit Date      85 non-null     datetime64[ns]
dtypes: datetime64[ns](2), float64(1), int64(2), object(9)
memory usage: 109.5+ KB
None

In [21]:
data.describe()

,Age,Hire Date,Annual Salary,Bonus %,Exit Date
count,1000.000000,1000,1000.000000,1000.000000,85
mean,44.382000,2012-04-07 02:54:14.400000,113217.365000,0.088660,2016-11-02 18:04:14.117647104
min,25.000000,1992-01-09 00:00:00,40063.000000,0.000000,1994-12-18 00:00:00
25%,35.000000,2007-02-14 00:00:00,71430.250000,0.000000,2014-12-25 00:00:00
50%,45.000000,2014-02-15 12:00:00,96557.000000,0.000000,2019-05-23 00:00:00
75%,54.000000,2018-06-22 00:00:00,150782.250000,0.150000,2021-04-09 00:00:00
max,65.000000,2021-12-26 00:00:00,258498.000000,0.400000,2022-08-17 00:00:00
std,11.246981,NaN,53545.985644,0.117856,NaN

In [20]:
print(data.describe())

               Age                   Hire Date  Annual Salary      Bonus %  \
count  1000.000000                        1000    1000.000000  1000.000000
mean     44.382000  2012-04-07 02:54:14.400000  113217.365000     0.088660
min      25.000000         1992-01-09 00:00:00   40063.000000     0.000000
25%      35.000000         2007-02-14 00:00:00   71430.250000     0.000000
50%      45.000000         2014-02-15 12:00:00   96557.000000     0.000000
75%      54.000000         2018-06-22 00:00:00  150782.250000     0.150000
max      65.000000         2021-12-26 00:00:00  258498.000000     0.400000
std      11.246981                         NaN   53545.985644     0.117856

                           Exit Date
count                             85
mean   2016-11-02 18:04:14.117647104
min              1994-12-18 00:00:00
25%              2014-12-25 00:00:00
50%              2019-05-23 00:00:00
75%              2021-04-09 00:00:00
max              2022-08-17 00:00:00
std                              NaN

In [18]:
data.isnull().count()

EEID             1000
Full Name        1000
Job Title        1000
Department       1000
Business Unit    1000
Gender           1000
Ethnicity        1000
Age              1000
Hire Date        1000
Annual Salary    1000
Bonus %          1000
Country          1000
City             1000
Exit Date        1000
dtype: int64

In [19]:
data.isnull().sum()

EEID               0
Full Name          0
Job Title          0
Department         0
Business Unit      0
Gender             0
Ethnicity          0
Age                0
Hire Date          0
Annual Salary      0
Bonus %            0
Country            0
City               0
Exit Date        915
dtype: int64

In [ ]:
# WORKING WITH MISSING DATA

In [23]:
import pandas as pd

data=pd.read_csv("company1.csv")
print(data)

    EEID      Name gender   salary
0  EMP01    ayushi      F      NaN
1  EMP02     rohit      M  25000.0
2  EMP03  pranjali    NaN  27000.0
3  EMP01    ayushi      F  20000.0
4  EMP05       NaN      M  25000.0
5  EMP06     rohit      M      NaN
6  EMP02     rohit      M  25000.0

In [27]:
data.isnull().sum()

EEID      0
Name      1
gender    1
salary    2
dtype: int64

In [28]:
data.dropna()

    EEID    Name gender   salary
1  EMP02   rohit      M  25000.0
3  EMP01  ayushi      F  20000.0
6  EMP02   rohit      M  25000.0

In [34]:
print(data)
print(data["salary"].mean())

    EEID      Name gender   salary
0  EMP01    ayushi      F      NaN
1  EMP02     rohit      M  25000.0
2  EMP03  pranjali    NaN  27000.0
3  EMP01    ayushi      F  20000.0
4  EMP05       NaN      M  25000.0
5  EMP06     rohit      M      NaN
6  EMP02     rohit      M  25000.0
24400.0

In [38]:
import numpy as np

print(data.replace(np.nan,"24400"))

    EEID      Name gender   salary
0  EMP01    ayushi      F    24400
1  EMP02     rohit      M  25000.0
2  EMP03  pranjali  24400  27000.0
3  EMP01    ayushi      F  20000.0
4  EMP05     24400      M  25000.0
5  EMP06     rohit      M    24400
6  EMP02     rohit      M  25000.0

In [3]:
import numpy as np
import pandas as pd
data=pd.read_csv("company1.csv")
data["salary"]=data["salary"].replace(np.nan,"24400")
print(data)

    EEID      Name gender   salary
0  EMP01    ayushi      F    24400
1  EMP02     rohit      M  25000.0
2  EMP03  pranjali    NaN  27000.0
3  EMP01    ayushi      F  20000.0
4  EMP05       NaN      M  25000.0
5  EMP06     rohit      M    24400
6  EMP02     rohit      M  25000.0

In [6]:
import numpy as np
import pandas as pd
data=pd.read_csv("company1.csv")
print(data.fillna(method="bfill"))

    EEID      Name gender   salary
0  EMP01    ayushi      F  25000.0
1  EMP02     rohit      M  25000.0
2  EMP03  pranjali      F  27000.0
3  EMP01    ayushi      F  20000.0
4  EMP05     rohit      M  25000.0
5  EMP06     rohit      M  25000.0
6  EMP02     rohit      M  25000.0

C:\Users\BAHRIA\AppData\Local\Temp\ipykernel_7212\1168216650.py:4: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  print(data.fillna(method="bfill"))

In [12]:
print(data.fillna(method="ffill"))

    EEID      Name gender   salary
0  EMP01    ayushi      F      NaN
1  EMP02     rohit      M  25000.0
2  EMP03  pranjali      M  27000.0
3  EMP01    ayushi      F  20000.0
4  EMP05    ayushi      M  25000.0
5  EMP06     rohit      M  25000.0
6  EMP02     rohit      M  25000.0

C:\Users\BAHRIA\AppData\Local\Temp\ipykernel_7212\2373199802.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  print(data.fillna(method="ffill"))

In [19]:
import numpy as np
import pandas as pd
data=pd.read_csv("company1.csv")
data["salary"]=data["salary"].replace(np.nan,"30000")
data["gender"]=data["gender"].replace(np.nan,"F")
data["Name"]=data["Name"].replace(np.nan,"Kohli")
print(data)

    EEID      Name gender   salary
0  EMP01    ayushi      F    30000
1  EMP02     rohit      M  25000.0
2  EMP03  pranjali      F  27000.0
3  EMP01    ayushi      F  20000.0
4  EMP05     Kohli      M  25000.0
5  EMP06     rohit      M    30000
6  EMP02     rohit      M  25000.0

In [ ]:
# HANDLING DUPLICATES VALUES

In [1]:
import pandas as pd
data=pd.read_csv("company1.csv")
df=pd.DataFrame(data)
print(df)

    EEID      Name gender   salary
0  EMP01    ayushi      F      NaN
1  EMP02     rohit      M  25000.0
2  EMP03  pranjali    NaN  27000.0
3  EMP01    ayushi      F  20000.0
4  EMP05       NaN      M  25000.0
5  EMP06     rohit      M      NaN
6  EMP02     rohit      M  25000.0

In [2]:
print(data.duplicated())

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [6]:
print(data["Name"].duplicated())

import pandas as pd
data=pd.read_csv("company1.csv")
df=pd.DataFrame(data)
print(df.drop_duplicates("Name"))

0    False
1    False
2    False
3     True
4    False
5     True
6     True
Name: Name, dtype: bool
    EEID      Name gender   salary
0  EMP01    ayushi      F      NaN
1  EMP02     rohit      M  25000.0
2  EMP03  pranjali    NaN  27000.0
4  EMP05       NaN      M  25000.0

In [4]:
print(data["Name"].duplicated().sum())

3

In [5]:
print(data["Name"].duplicated().count())

7